Enums/ВидыОперацийПлатежногоПоручения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПлатежногоПоручения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеПрочихДоходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеПрочихВыплат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПлатежногоПоручения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ИспользуютсяВзаиморасчетыПоПрочимДоходам = Ложь;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыРасширеннаяПодсистемы.Выплаты.ВзаиморасчетыПоПрочимДоходам") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ВзаиморасчетыПоПрочимДоходам");
		ИспользуютсяВзаиморасчетыПоПрочимДоходам = Модуль.ИспользуютсяВзаиморасчетыПоПрочимДоходам();
	КонецЕсли;
	
	ИспользоватьРегистрациюПрочихВыплат = ПолучитьФункциональнуюОпцию("ИспользоватьРегистрациюПрочихВыплат");
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеЗарплаты);
	
	Если ИспользуютсяВзаиморасчетыПоПрочимДоходам Тогда
		ДанныеВыбора.Добавить(Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихДоходов);
	КонецЕсли;
	
	Если ИспользоватьРегистрациюПрочихВыплат Тогда
		ДанныеВыбора.Добавить(Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихВыплат);
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
	
#КонецЕсли
